//В файле for-loop.js напиши цикл for, который повторится 10 раз.
// Каждый раз выводи в консоль текст "hello, intocode".

for (let i = 0; i < 10; i++) {
  console.log("hello, intocode");
}
//--------------------------------------------------------------------------------------
//В том же файле ниже напиши цикл for, который повторится миллион раз.
//В консоль ничего выводить не нужно.

for (let i = 0; i < 1000000; i++) {}

//--------------------------------------------------------------------------------------
//Ниже напиши цикл for, который выведет в консоль числа от 0 до 100.

//Ниже напиши цикл for, который выведет в консоль числа от 500 до 1000.

//Ниже напиши цикл for, который выведет в консоль числа от 1000 до 0.

for (let i = 0; i <= 100; i++) {
  console.log(i);
}
for (let i = 500; i <= 1000; i++) {
  console.log(i);
}
for (let i = 1000; i > 0; i--) {
  console.log(i);
}
